# Data Cleaning and Preparation

# Handling Missing Data

In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
a=pd.Series(["bushra",np.nan,"karachi"])

In [4]:
a

0     bushra
1        NaN
2    karachi
dtype: object

In [5]:
a.isnull()

0    False
1     True
2    False
dtype: bool

In [6]:
a.dropna()

0     bushra
2    karachi
dtype: object

In [7]:
a

0     bushra
1        NaN
2    karachi
dtype: object

In [8]:
a.notnull()

0     True
1    False
2     True
dtype: bool

# FILTERING

In [9]:
NA=np.nan

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], 
                       [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
data.isnull()

       0      1      2
0  False  False  False
1  False   True   True
2   True   True   True
3   True  False  False

In [13]:
data[data.isnull()]

    0   1   2
0 NaN NaN NaN
1 NaN NaN NaN
2 NaN NaN NaN
3 NaN NaN NaN

In [14]:
data[data.notnull()]# is equivalent to dropna

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how="all",axis=0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
# it drop row which all values are nan

In [18]:
data[4]=np.nan

In [19]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [20]:
data.dropna(how="all",axis=1)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [21]:
# it drop col whose all values are null

In [22]:
data.dropna(thresh=2)# is m hm btaty hn k kitni values hon tu return kryn

     0    1    2   4
0  1.0  6.5  3.0 NaN
3  NaN  6.5  3.0 NaN

In [23]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

# Filling In Missing Data

In [24]:
data.fillna(0)

     0    1    2    4
0  1.0  6.5  3.0  0.0
1  1.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  6.5  3.0  0.0

In [25]:
# it fill nan with the given values

In [26]:
data.fillna(method='ffill',limit=1)# limit parameter we can limit the no of values to be filled

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  6.5  3.0 NaN
2  1.0  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [27]:
data.fillna

<bound method DataFrame.fillna of      0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN>

In [28]:
 data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 
                      'k2': [1, 1, 2, 3, 3, 4, 4]})

In [29]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [30]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [31]:
# it returns true when a row is same to the previous one

In [32]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [33]:
# it returns the false one rows

In [34]:
data["v1"]=[1,2,4,6,3,2,1]

In [35]:
data.drop_duplicates(["k1"])

    k1  k2  v1
0  one   1   1
1  two   1   2

In [36]:
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   1
1  two   1   2
2  one   2   4
3  two   3   6
4  one   3   3
6  two   4   1

In [37]:
data

    k1  k2  v1
0  one   1   1
1  two   1   2
2  one   2   4
3  two   3   6
4  one   3   3
5  two   4   2
6  two   4   1

# Transforming Data Using a Function or Mapping

In [38]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',  
                              'Pastrami', 'corned beef', 'Bacon',  
                              'pastrami', 'honey ham', 'nova lox'],   
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [39]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [41]:
meat_to_animal = {  'bacon': 'pig',  'pulled pork': 'pig',  'pastrami': 'cow',  'corned beef': 'cow',  'honey ham': 'pig',  'nova lox': 'salmon' }

In [42]:
lower=data["food"].str.lower()

In [43]:
lower

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [44]:
data["animal"]=lower.map(meat_to_animal)

In [45]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [46]:
data["food"].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [47]:
#map fuction apply element wise

# REPLACING

In [48]:
s1=pd.Series([1,22,44,24,255,23,233,24])

In [49]:
s1

0      1
1     22
2     44
3     24
4    255
5     23
6    233
7     24
dtype: int64

In [50]:
s1.replace(255,25,inplace=True)

In [51]:
s1.replace([22,44],np.nan)

0      1.0
1      NaN
2      NaN
3     24.0
4     25.0
5     23.0
6    233.0
7     24.0
dtype: float64

In [52]:
s1.replace([22,233],["bushra",34])# we can pass list for multiple arguments

0         1
1    bushra
2        44
3        24
4        25
5        23
6        34
7        24
dtype: object

In [53]:
s1.replace({233:100})# we can also give arguments as dic

0      1
1     22
2     44
3     24
4     25
5     23
6    100
7     24
dtype: int64

# Renaming Axis Indexes

In [54]:
 data = pd.DataFrame(np.arange(12).reshape((3, 4)),   
                     index=['Ohio', 'Colorado', 'New York'],   
                     columns=['one', 'two', 'three', 'four'])

In [55]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [56]:
transform=lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [57]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [58]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [59]:
data.rename(index=str.title,columns=str.upper,inplace=True)

In [60]:
data

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [61]:
data.rename({"Ohio":"Pak"})

          ONE  TWO  THREE  FOUR
Pak         0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [62]:
data.rename(index={"Ohio":"Pak"})

          ONE  TWO  THREE  FOUR
Pak         0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [63]:
data.rename(columns={"ONE":"Pak"})

          Pak  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [64]:
# by default it consider index if we not mention

# Discretization and Binning

In [65]:
 ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)

In [66]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [67]:
cats = pd.cut(ages, bins,right=False)

In [68]:
cats

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [69]:
cats.codes

array([0, 0, 1, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [70]:
cats.categories

IntervalIndex([[18, 25), [25, 35), [35, 60), [60, 100)],
              closed='left',
              dtype='interval[int64]')

In [71]:
pd.value_counts(cats)

[25, 35)     4
[18, 25)     4
[35, 60)     3
[60, 100)    1
dtype: int64

In [72]:
a=pd.DataFrame(np.arange(12).reshape(3,4))

In [73]:
a

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [75]:
np.sign(a)# it return 1 for positive value ,-1 for negative and o for 0:

   0  1  2  3
0  0  1  1  1
1  1  1  1  1
2  1  1  1  1

In [76]:
np.abs(pd.Series([-2,2,-4.5,-12,45]))

0     2.0
1     2.0
2     4.5
3    12.0
4    45.0
dtype: float64

In [78]:
a.describe()

         0    1     2     3
count  3.0  3.0   3.0   3.0
mean   4.0  5.0   6.0   7.0
std    4.0  4.0   4.0   4.0
min    0.0  1.0   2.0   3.0
25%    2.0  3.0   4.0   5.0
50%    4.0  5.0   6.0   7.0
75%    6.0  7.0   8.0   9.0
max    8.0  9.0  10.0  11.0

# Permutation and Random Sampling

In [79]:
df=pd.DataFrame(np.arange(20).reshape(5,4))

In [98]:
sampler=np.random.permutation(5)

In [99]:
sampler

array([4, 0, 2, 1, 3])

In [100]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
0   0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15

In [101]:
# we can use np.random.permutation to get random array of index of series or dataframe

In [102]:
df.sample()

    0   1   2   3
4  16  17  18  19

In [105]:
df.sample()# it will give random row

    0   1   2   3
3  12  13  14  15

In [106]:
df.sample(n=2)

   0  1   2   3
0  0  1   2   3
2  8  9  10  11

In [110]:
df.sample(n=10,replace=True)# by replace True we get sample twice

    0   1   2   3
4  16  17  18  19
2   8   9  10  11
4  16  17  18  19
4  16  17  18  19
4  16  17  18  19
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15

In [108]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

# String Manipulation

In [111]:
st="bushra,Afsar, Aloo"

In [113]:
a=st.split(",")

In [114]:
a

['bushra', 'Afsar', ' Aloo']

In [122]:
a=[x.lstrip() for x in a]#it strip the whitespace

In [123]:
a

['bushra', 'Afsar', 'Aloo']

In [119]:
":".join(a)

'bushra:Afsar:Aloo'

In [120]:
# it take list as argument and join the str element as one

In [126]:
st.find("a")

5

In [127]:
#it give the index no

In [128]:
st.index("a")

5

In [131]:
st.replace("a","b")#it replace the val

'bushrb,Afsbr, Aloo'

In [132]:
st

'bushra,Afsar, Aloo'

In [133]:
st.count("a")

2

In [134]:
st.count("j")

0

In [135]:
"a" in st

True

In [136]:
st.startswith("b")

True

In [145]:
st.endswith("l")

False

In [146]:
s1=pd.Series(["abcd","bnjgfh","ghj"])

In [147]:
s1

0      abcd
1    bnjgfh
2       ghj
dtype: object

In [150]:
s1.str[0]

0    a
1    b
2    g
dtype: object

In [149]:
# we can slice the str of series ths way

In [151]:
st.pad()

AttributeError: 'str' object has no attribute 'pad'